# Дана строка. Замените в этой
# строке все цифры 1 на слово one.
s = str(input())
s = s.replace("1", "one")
print(s)
