# Дано натуральное число n>1. Проверьте, является ли
# оно простым. Программа должна вывести слово YES, если
# число простое и NO, если число составное. Решение оформите
# в виде функции IsPrime(n), которая возвращает True для
# простых чисел и False для составных чисел. Программа
# должна иметь сложность O(корень из n): количество
# действий в программе должно быть пропорционально
# квадратному корню из n (иначе говоря, при увеличении
# входного числа в k раз, время выполнения программы
# должно увеличиваться примерно в корень из k раз).
from math import sqrt
n = int(input())


def MinDivisor(n):
    i = 1
    while i <= sqrt(n):
        if n % i == 0 and i > 1:
            break
        i += 1
    else:
        i = n
    return i


def IsPrime(n):
    if n == 2:
        print('YES')
    elif MinDivisor(n) == n:
        print('YES')
    else:
        print('NO')


IsPrime(n)
