# Дана строка. Удалите из этой строки все символы @.
s = str(input())
s = s.replace("@", "")
print(s)
